Repository: Marcel-Goehn/Portfolio
Catalog: src/locale/messages.*.xlf
Languages: de

source: Return to landing page
de: Zurück zur Startseite

source: Legal Notice
de: Rechtlicher Hinweis

source: Imprint
de: Impressum

source: Exploring the board
de: Erkundung des Boards

source: Acceptance of terms
de: Annahme der Bedingungen

source: By accessing and using <span>Portfolio</span> (Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. We, the listed students, may update or change the terms and conditions from time to time without notice.
de: Durch den Zugriff auf und die Nutzung von <span>Portfolio</span> (Produkt) erkennen Sie die folgenden Geschäftsbedingungen sowie alle Richtlinien, Leitlinien oder Änderungen an, die Ihnen von Zeit zu Zeit präsentiert werden können, an und stimmen ihnen zu. Wir, die aufgeführten Studierenden, können die Geschäftsbedingungen von Zeit zu Zeit ohne vorherige Ankündigung aktualisieren oder ändern.

source: Scope and ownership of the product
de: Umfang und Eigentum des Produkts

source: <span>Portfolio</span> has been developed as part of a student group project in a web development bootcamp at the <span>Developer Akademie GmbH</span>. It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product.
de: <span>Portfolio</span> wurde im Rahmen eines Gruppenprojekts in einem Web-Development-Bootcamp bei der <span>Developer Akademie GmbH</span> entwickelt. Es dient ausschließlich zu Ausbildungszwecken und ist nicht für eine umfassende private oder geschäftliche Nutzung vorgesehen. Daher können wir keine durchgehende Verfügbarkeit, Zuverlässigkeit, Genauigkeit oder sonstige Qualitätsmerkmale dieses Produkts garantieren.

source: The design of <span>Portfolio</span> is owned by the <span>Developer Akademie GmbH</span>. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.
de: Das Design von <span>Portfolio</span> ist Eigentum der <span>Developer Akademie GmbH</span>. Eine unautorisierte Nutzung, Vervielfältigung, Veränderung, Verbreitung oder Nachbildung des Designs ist strengstens untersagt.

source: Proprietary rights
de: Eigentumsrechte

source: Aside from the design owned by <span>Developer Akademie GmbH</span>, we, the listed students, retain all proprietary rights in <span>Portfolio</span>, including any associated copyrighted material, trademarks, and other proprietary information.
de: Abgesehen von dem Design, das Eigentum der <span>Developer Akademie GmbH</span> ist, behalten wir, die aufgeführten Studierenden, alle Eigentumsrechte an <span>Portfolio</span>, einschließlich aller damit verbundenen urheberrechtlich geschützten Materialien, Marken und sonstigen Eigentumsinformationen.

source: Use of the product
de: Nutzung des Produkts

source: <span>Portfolio</span> is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of <span>Portfolio</span> for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of <span>Portfolio</span>.
de: <span>Portfolio</span> darf ausschließlich für rechtmäßige Zwecke und in Übereinstimmung mit allen geltenden Gesetzen und Vorschriften verwendet werden. Jegliche Nutzung von <span>Portfolio</span> für illegale Aktivitäten oder zum Belästigen, Schädigen, Bedrohen oder Einschüchtern anderer Personen ist strengstens untersagt. Sie sind allein verantwortlich für Ihre Interaktionen mit anderen Nutzern von <span>Portfolio</span>.

source: Disclaimer of warranties and limitation of liability
de: Haftungsausschluss und Begrenzung der Haftung

source: <span>Portfolio</span> is provided "as is" without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will we, the listed students, or the <span>Developer Akademie</span>, be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of <span>Portfolio</span>.
de: <span>Portfolio</span> wird „wie besehen“ bereitgestellt, ohne jegliche ausdrückliche oder stillschweigende Gewährleistung, einschließlich, aber nicht beschränkt auf stillschweigende Garantien der Marktgängigkeit, Eignung für einen bestimmten Zweck und Nichtverletzung von Rechten Dritter. In keinem Fall haften wir, die aufgeführten Studierenden, oder die <span>Developer Akademie</span> für direkte, indirekte, zufällige, besondere, Folge- oder exemplarische Schäden – einschließlich, aber nicht beschränkt auf Schäden aus entgangenem Gewinn, Goodwill, Nutzung, Daten oder anderen immateriellen Verlusten –, selbst wenn wir auf die Möglichkeit solcher Schäden hingewiesen wurden, die sich aus der Nutzung oder Leistung von <span>Portfolio</span> ergeben.

source: Indemnity
de: Schadloshaltung

source: You agree to indemnify, defend and hold harmless us, the listed students, the <span>Developer Akademie</span>, and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of <span>Portfolio</span> and/or your breach of this Legal Notice.
de: Sie erklären sich damit einverstanden, uns, die aufgeführten Studierenden, die <span>Developer Akademie</span> sowie unsere verbundenen Unternehmen, Partner, Führungskräfte, Direktoren, Vertreter und Mitarbeitenden von jeglichen Ansprüchen, Forderungen, Verlusten, Schäden, Kosten oder Haftungen (einschließlich angemessener Anwaltsgebühren) freizustellen, zu verteidigen und schadlos zu halten, die sich aus Ihrer Nutzung von <span>Portfolio</span> und/oder aus Ihrem Verstoß gegen diesen Rechtlichen Hinweis ergeben.

source: For any questions or notices, please contact me at marcelgoehn@googlemail.com
de: Für Fragen oder Mitteilungen kontaktieren Sie mich bitte unter marcelgoehn@googlemail.com

source: Date: September 11, 2025
de: Datum: 11. September 2025

source: An image of myself
de: Ein Bild von mir selbst

source: Who I Am
de: Wer ich bin

source: About Me
de: Über mich

source: Hey there, I'm Marcel! Since my childhood, I’ve been fascinated by computers and video games – today, I bring my own applications and solutions to life through code.
de: Hallo, ich bin Marcel! Seit meiner Kindheit faszinieren mich Computer und Videospiele – heute erwecke ich mit Code meine eigenen Anwendungen und Lösungen zum Leben.

source: An icon to represent the location
de: Ein Symbol zur Darstellung des Standorts

source: Currently living in Aurich, Germany. I'm open to work remotely and at the companys office.
de: Derzeit lebe ich in Aurich, Deutschland. Ich bin offen für Remote-Arbeit sowie für Tätigkeiten im Büro des Unternehmens.

source: An icon with a thinking head
de: Ein Symbol mit einem nachdenklichen Kopf

source: I’m eager to kick off my career as a Fullstack Web Developer and further expand into cloud and mobile app development
de: Ich freue mich darauf, meine Karriere als Fullstack-Webentwickler zu starten und mich anschließend weiter in den Bereichen Cloud- und Mobile-App-Entwicklung zu vertiefen.

source: A checkmark icon
de: Ein Häkchen-Symbol

source: As a creative and analytical team player, I like to get challenged with complex problems to learn from them and to further expand my expertise as a Software developer.
de: Als kreativer und analytischer Teamplayer lasse ich mich gerne von komplexen Problemen herausfordern, um daraus zu lernen und meine Expertise als Softwareentwickler weiter auszubauen.

source: What my colleagues say about me
de: Was meine Kolleginnen und Kollegen über mich sagen

source: Working with Marcel was always reliable and pleasant. He communicates clearly, thinks ahead, and delivers clean, well-documented code. Deadlines were consistently met, and even during challenging phases, he remained solution-oriented and professional.
de: Die Zusammenarbeit mit Marcel war stets zuverlässig und angenehm. Er kommuniziert klar, denkt vorausschauend und liefert sauberen, gut dokumentierten Code. Termine wurden konsequent eingehalten, und selbst in anspruchsvollen Phasen blieb er lösungsorientiert und professionell.

source: Working with Marcel was a pleasure. His quick understanding of complex problems and clean, maintainable code pushed our project forward.
de: Die Zusammenarbeit mit Marcel war eine Freude. Sein schnelles Verständnis komplexer Probleme und sein sauberer, gut wartbarer Code haben unser Projekt vorangebracht.

source: Marcel consistently delivers high-quality work and brings great ideas to the table. His positive attitude keeps the whole team motivated.
de: Marcel liefert stets Arbeit von hoher Qualität und bringt großartige Ideen ein. Seine positive Einstellung hält das gesamte Team motiviert.

source: Marcel Göhn combines technical skill with a natural sense for teamwork. He not only writes clean and maintainable code, but also contributes valuable ideas that improve the overall project. Whenever unexpected issues appeared, Marcel approached them with creativity and a calm mindset, making him a trusted problem-solver.
de: Marcel Göhn verbindet technisches Können mit einem natürlichen Sinn für Teamarbeit. Er schreibt nicht nur sauberen und gut wartbaren Code, sondern bringt auch wertvolle Ideen ein, die das Gesamtprojekt verbessern. Wann immer unerwartete Probleme auftraten, begegnete Marcel ihnen mit Kreativität und einem ruhigen Geist, was ihn zu einem verlässlichen Problemlöser macht.

source: It’s rare to meet someone as dependable as Marcel. He takes ownership of his work, delivers on time, and keeps communication transparent. Whether refining details or tackling major features, Marcel shows both precision and dedication, which consistently raises the quality of our results.
de: Es ist selten, jemand so verlässlichen wie Marcel zu treffen. Er übernimmt Verantwortung für seine Arbeit, liefert pünktlich und sorgt für eine transparente Kommunikation. Ob es darum geht, Details zu verfeinern oder große Funktionen umzusetzen – Marcel zeigt sowohl Präzision als auch Engagement, was die Qualität unserer Ergebnisse kontinuierlich steigert.

source: Thanks! Your email is on its way. We’ll be in touch soon.
de: Danke! Ihre E-Mail ist auf dem Weg. Wir werden uns bald bei Ihnen melden.

source: Contact me
de: Kontaktieren Sie mich

source: Let's work together
de: Lassen Sie uns zusammenarbeiten

source: Got a problem to solve?
de: Haben Sie ein Problem zu lösen?

source: Encourage people to contact you and describe what role you are interested in. Show that you will add value to their projects through your work.
de: Ermutigen Sie Menschen, Sie zu kontaktieren, und beschreiben Sie, an welcher Rolle Sie interessiert sind. Zeigen Sie, dass Sie durch Ihre Arbeit einen Mehrwert zu ihren Projekten beitragen werden.

source: Need a Frontend developer? <span>Let's talk!</span>
de: Brauchen Sie einen Frontend-Entwickler? <span>Lassen Sie uns reden!</span>

source: What's your name?
de: Wie heißen Sie?

source: Your name goes here
de: Ihr Name kommt hier hin

source: Oops! It seems your name is missing
de: Ups! Es scheint, dass Ihr Name fehlt

source: What's your email?
de: Wie lautet Ihre E-Mail-Adresse?

source: Hoppla! Your email is required
de: Hoppla! Ihre E-Mail-Adresse wird benötigt

source: How can I help you?
de: Wie kann ich Ihnen helfen?

source: Hello Marcel, I am interested in...
de: Hallo Marcel, ich bin interessiert an …

source: What do you need to develop?
de: Was möchten Sie entwickeln lassen?

source: I've read the <span class="fira privacy-highlight">privacy policy</span> and agree to the processing of my data as outlined.
de: Ich habe die <span class="fira privacy-highlight">Datenschutzerklärung</span> gelesen und stimme der darin beschriebenen Verarbeitung meiner Daten zu.

source: Please accept the privacy policy.
de: Bitte akzeptieren Sie die Datenschutzerklärung.

source: Say Hello ;)
de: Sag Hallo ;)

source: What is this project about?
de: Worum geht es in diesem Projekt?

source: No skills have been used.
de: Es wurden keine Skills verwendet.

source: Arrow SVG
de: Pfeil-SVG

source: Next project
de: Nächstes Projekt

source: Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.
de: Aufgabenmanager inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben mithilfe von Drag-&-Drop-Funktionen und weisen Sie Benutzer und Kategorien zu.

source: Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.
de: Jump-, Run- und Wurfspiel auf objektorientierter Basis. Hilf Pepe, Münzen und Tabasco-Salsa zu finden, um gegen das verrückte Huhn zu kämpfen.

source: This app is a dynamic Pokédex built with HTML, CSS and JavaScript. It fetches Pokémon data from an API and displays each creature with its name, image and type. Users can quickly search and explore different Pokémon in an interactive and responsive interface.
de: Diese App ist ein dynamischer Pokédex, erstellt mit HTML, CSS und JavaScript. Sie ruft Pokémon-Daten von einer API ab und zeigt jede Kreatur mit Name, Bild und Typ an. Nutzer können schnell verschiedene Pokémon suchen und in einer interaktiven und responsiven Oberfläche erkunden.

source: Featured Projects
de: Ausgewählte Projekte

source: Explore a selection of my work here - Interact with<br>projects to see my skills in action.
de: Entdecken Sie hier eine Auswahl meiner Arbeiten – interagieren Sie mit<br>Projekten, um meine Fähigkeiten in Aktion zu sehen.

source: My Join kanban board for tracking tasks
de: Mein Join-Kanban-Board zur Nachverfolgung von Aufgaben

source: A screenshot of Pepe, the character of El-Pollo-Loco
de: Ein Screenshot von Pepe, der Figur aus El-Pollo-Loco

source: A screenshot of my Pokedex
de: Ein Screenshot meines Pokédex

source: Frontend Developer
de: Frontend-Entwickler

source: Check my work
de: Schauen Sie sich meine Arbeit an

source: Contact me
de: Kontaktieren Sie mich

source: E-Mail icon in white
de: E-Mail-Symbol in Weiß

source: Github icon in white
de: GitHub-Symbol in Weiß

source: Linkedin icon in white
de: LinkedIn-Symbol in Weiß

source: Available for remote work
de: Verfügbar für Remote-Arbeit

source: Based in Aurich
de: Mit Sitz in Aurich

source: Open to work
de: Offen für neue berufliche Möglichkeiten

source: Technologies
de: Technologien

source: Skill Set
de: Fähigkeiten

source: I create modern, user-friendly web apps with HTML, CSS, and JavaScript, strengthened by TypeScript and Angular. Using Material Design, Git, Firebase, and REST APIs, I build clean, scalable solutions. With Scrum experience and a strong growth mindset, I keep learning and adapt quickly to new technologies.
de: Ich entwickle moderne, benutzerfreundliche Web-Apps mit HTML, CSS und JavaScript, ergänzt durch TypeScript und Angular. Mithilfe von Material Design, Git, Firebase und REST-APIs erstelle ich saubere, skalierbare Lösungen. Mit Scrum-Erfahrung und einer ausgeprägten Lernbereitschaft eigne ich mir schnell neue Technologien an und passe mich ihnen an.

source: You need <span class="fira">another skill?</span>
de: Sie brauchen <span class="fira">eine weitere Fähigkeit?</span>

source: Feel free to contact me. I look forward to expanding on my previous knowledge.
de: Kontaktieren Sie mich gerne. Ich freue mich darauf, mein bisheriges Wissen zu erweitern.

source: Let's Talk
de: Lass uns reden

source: Next technologies I aim to learn
de: Nächste Technologien, die ich lernen möchte

source: Privacy Policy
de: Datenschutzerklärung

source: Responsible entity
de: Verantwortliche Stelle

source: General information
de: Allgemeine Informationen

source: Protecting your personal data is very important to me. I treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy. This privacy policy informs you about what data I collect, how I use it, and what rights you have regarding your data.
de: Der Schutz Ihrer persönlichen Daten ist mir sehr wichtig. Ich behandle Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung. Diese Datenschutzerklärung informiert Sie darüber, welche Daten ich erhebe, wie ich sie verwende und welche Rechte Sie in Bezug auf Ihre Daten haben.

source: This website is hosted via Firebase Hosting. The hosting provider automatically processes your IP address and other technical data when you access the site to ensure its operation. This information is stored in so-called server log files and includes:
de: Diese Website wird über Firebase Hosting betrieben. Der Hosting-Anbieter verarbeitet automatisch Ihre IP-Adresse und weitere technische Daten, wenn Sie die Seite aufrufen, um deren Betrieb sicherzustellen. Diese Informationen werden in sogenannten Server-Logfiles gespeichert und umfassen:

source: IP address of the requesting device
de: IP-Adresse des anfragenden Geräts

source: Date and time of access
de: Datum und Uhrzeit des Zugriffs

source: Browser type and version
de: Browsertyp und -version

source: Operating system used
de: Verwendetes Betriebssystem

source: This data is used solely for technical administration and is not merged with other data sources.
de: Diese Daten werden ausschließlich für die technische Administration verwendet und nicht mit anderen Datenquellen zusammengeführt.

source: Collection and processing of personal data
de: Erhebung und Verarbeitung personenbezogener Daten

source: My website includes a contact form. I collect the following personal data through this form:
de: Meine Website enthält ein Kontaktformular. Über dieses Formular erhebe ich folgende personenbezogene Daten:

source: First and last name
de: Vor- und Nachname

source: Email address
de: E-Mail-Adresse

source: This data is used solely to contact you or to provide the website’s features.
de: Diese Daten werden ausschließlich verwendet, um Sie zu kontaktieren oder die Funktionen der Website bereitzustellen.

source: Storage and Security:
de: Speicherung und Sicherheit:

source: Data transmission is encrypted (e.g., via HTTPS, if enabled).
de: Die Datenübertragung ist verschlüsselt (z. B. über HTTPS, sofern aktiviert).

source: Data Disclosure
de: Datenweitergabe

source: Your personal data is not shared with third parties. No data is transferred outside the European Union.
de: Ihre personenbezogenen Daten werden nicht an Dritte weitergegeben. Es werden keine Daten außerhalb der Europäischen Union übermittelt.

source: Use of Cookies
de: Verwendung von Cookies

source: This website does not use cookies.
de: Diese Website verwendet keine Cookies.

source: Analytics and Tracking Tools
de: Analyse- und Tracking-Tools

source: No tracking or analytics tools (e.g., Google Analytics, Matomo) are used on this website.
de: Auf dieser Website werden keine Tracking- oder Analysetools (z. B. Google Analytics, Matomo) verwendet.

source: Your Rights
de: Ihre Rechte

source: You have the right to:
de: Sie haben das Recht auf:

source: Access the personal data we store (Art. 15 GDPR)
de: Einsicht in die von uns gespeicherten personenbezogenen Daten (Art. 15 DSGVO)

source: Rectify inaccurate data (Art. 16 GDPR)
de: Berichtigung unrichtiger Daten (Art. 16 DSGVO)

source: Request deletion of your data (Art. 17 GDPR)
de: Löschung Ihrer Daten beantragen (Art. 17 DSGVO)

source: Restrict processing of your data (Art. 18 GDPR)
de: Einschränkung der Verarbeitung Ihrer Daten verlangen (Art. 18 DSGVO)

source: Object to the processing of your data (Art. 21 GDPR)
de: Widerspruch gegen die Verarbeitung Ihrer Daten einlegen (Art. 21 DSGVO)

source: Data portability (Art. 20 GDPR)
de: Datenübertragbarkeit (Art. 20 DSGVO)

source: To exercise these rights, you can contact me via email: marcelgoehn@googlemail.com
de: Um diese Rechte auszuüben, können Sie mich per E-Mail kontaktieren: marcelgoehn@googlemail.com

source: Data Retention
de: Datenspeicherung

source: I store your personal data only as long as necessary for the intended purpose or as required by law.
de: Ich speichere Ihre personenbezogenen Daten nur so lange, wie es für den vorgesehenen Zweck erforderlich ist oder gesetzlich vorgeschrieben wird.

source: Data Security
de: Datensicherheit

source: I implement technical and organizational security measures to protect your data against manipulation, loss, destruction, or unauthorized access.
de: Ich setze technische und organisatorische Sicherheitsmaßnahmen ein, um Ihre Daten vor Manipulation, Verlust, Zerstörung oder unbefugtem Zugriff zu schützen.

source: Changes to This Privacy Policy
de: Änderungen dieser Datenschutzerklärung

source: I reserve the right to amend this privacy policy at any time to comply with current legal requirements. The latest version is available on my website under the specified contact address.
de: Ich behalte mir das Recht vor, diese Datenschutzerklärung jederzeit zu ändern, um den aktuellen gesetzlichen Anforderungen zu entsprechen. Die jeweils gültige Version ist auf meiner Website unter der angegebenen Kontaktadresse abrufbar.

source: Last updated: September 2025
de: Zuletzt aktualisiert: September 2025

source: Web Developer
de: Webentwickler

source: Aurich Germany
de: Aurich, Deutschland

source: About me
de: Über mich

source: Projects
de: Projekte
